In [2]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'A': [1, 2, np.nan, 4, 5],   #nan means null values or incomplete data
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df=pd.DataFrame(data)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [6]:
df.isna().sum() # show the null value as column wise with all the sum of it for large data

A    1
B    0
C    2
D    3
dtype: int64

In [7]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

In [9]:
#removing misssing data it works on row wise
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [10]:
df.dropna(thresh=3) #give atlest theree values ex 4 didnt have more than 3 values.

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

In [12]:
#filling the missing data
df.fillna(value  = 0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [14]:
#filling uniquely value for each column 
values = {"B":10,"C":20,"D":30}
df.fillna(value=values)

     A  B     C     D
0  1.0  1   1.0   1.0
1  2.0  2   2.0  30.0
2  NaN  3   3.0  30.0
3  4.0  4  20.0  30.0
4  5.0  5  20.0   5.0